#include<stdio.h>
#include<wchar.h> // برای چاپ کردن کاراکتر های دو بایتی
int main()
{
    int x[5]; // تعریف یک آرایه
    x[0] = 25; // اختصاص مقدار به اندیس صفرم آرایه
    x[4] = 55; // اختصاص مقدار به اندیس چهارم یا آخر این آرایه
    int n[5][5]; // آرایه ی دوبعدی
    n[0][0] = 10; // اختصاص دادن یک مقدار به آرایه ی دو بعدی
    char y[] = "salam"; // آرایه ی کاراکتری
    wchar_t z[] = L"سلام"; // برای چاپ کردن کاراکتر فارسی باید ال بزرگ قبل از کوتیشن بذاریم
    printf("%d \n", x[4]); // چاپ کردن اندیس چهارم آرایه ی x
    printf("%s \n", y); // برای چاپ کردن آرایه ی یک بایتی
    wprintf(L"%s \n", z); // برای چاپ کردن آرایه ی دوبایتی
    return 0;
}